# Computer Science Project (Università di Milano Bicocca - Data Science)
- Federico Comotto 834010
- Massimiliano Scardovelli C. 772723

In [1]:
import pandas as pd
import numpy as np
import json

## Upload dataset

In [2]:
pd.set_option('display.float_format', lambda x: '%.3f' % x) #remove scientific notation (3 decimal)
credits = pd.read_csv("tmdb_5000_credits.csv")
movies = pd.read_csv("tmdb_5000_movies.csv")

In [3]:
credits.head()

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."
3,49026,The Dark Knight Rises,"[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba...","[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de..."
4,49529,John Carter,"[{""cast_id"": 5, ""character"": ""John Carter"", ""c...","[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de..."

In [4]:
movies.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.438,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.000,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.200,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.083,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.000,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.900,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.377,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.000,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.300,4466
3,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.313,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.000,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.600,9106
4,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,John Carter,"John Carter is a war-weary, former military ca...",43.927,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.000,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.100,2124

## 1. For each movie, compute the number of cast members.

In [5]:
credits.cast.head()

0    [{"cast_id": 242, "character": "Jake Sully", "...
1    [{"cast_id": 4, "character": "Captain Jack Spa...
2    [{"cast_id": 1, "character": "James Bond", "cr...
3    [{"cast_id": 2, "character": "Bruce Wayne / Ba...
4    [{"cast_id": 5, "character": "John Carter", "c...
Name: cast, dtype: object

In [6]:
type(credits.cast[0]), type(credits.crew[0]), type(movies.spoken_languages[0]) #it's a string

(str, str, str)

In [7]:
#function to transform string with dictionary in a list of dictionary
def string_to_dict (data, nome_colonne):
    '''
    data is the dataframe to preprocess: a pandas dataframe
    nome_colonne is the column name of the data to preprocess: a list of string name
    '''
    for i in range(len(nome_colonne)):
        data[nome_colonne[i]] = data[nome_colonne[i]].apply(json.loads)

In [8]:
#Preprocessing credits
credits_list = ["cast", "crew"]
string_to_dict(credits,credits_list)
#Preprocessing movies
movies_list = ["genres", "keywords", "production_companies", "production_countries", "spoken_languages"]
string_to_dict(movies,movies_list)

In [9]:
type(credits.cast[0]), type(credits.crew[0]), type(movies.spoken_languages[0]) #now it's a list of dictionary (example)

(list, list, list)

In [10]:
#function to discover number of id 
def count_id(lista_dict):
    '''
    lista_dict is a the list of dictionary where the key is "id"
    '''
    mylist = []
    for element in lista_dict:
        mylist.append(element["id"])
    mylist = set(mylist)
    number = len(set(mylist)) #use set to delete duplicates 
    return (number)

In [11]:
credits.cast.isna().sum() #check NA
credits["number_of_cast"] = credits.cast.apply(count_id)

In [12]:
credits[["movie_id","title","number_of_cast"]].head()

   movie_id                                     title  number_of_cast
0     19995                                    Avatar              83
1       285  Pirates of the Caribbean: At World's End              33
2    206647                                   Spectre              83
3     49026                     The Dark Knight Rises             158
4     49529                               John Carter              27

## 2. How many movies don't have a homepage.

In [13]:
movies.homepage.describe()

count                                 1712
unique                                1691
top       http://www.thehungergames.movie/
freq                                     4
Name: homepage, dtype: object

In [14]:
movies.homepage.isna().sum()

3091

In [15]:
movies.homepage.isnull().sum()

3091

## 3. For each year, how many movies don't have a homepage.

In [16]:
movies["release_date"] = pd.to_datetime(movies.release_date) #trasform to data format
movies["year"] = movies["release_date"].dt.year #extract year
NA_homepage_by_year = movies[movies.homepage.isna()].groupby("year").size() #groupby year and count
NA_homepage_by_year.head() #view

year
1916.000    1
1925.000    1
1927.000    1
1929.000    2
1930.000    1
dtype: int64

## 4. Extract the domain of each homepage.

In [17]:
import tldextract

In [18]:
def extract_dom (URL):
    '''
    URL (webpage): it's a string
    '''
    domain = tldextract.extract(URL) #particular type but support join operation as a list
    result = ".".join(element for element in domain if element) #join only if exist
    return result

In [19]:
homepage_not_null = movies.homepage.notnull()
movies["domain"] = movies[homepage_not_null].homepage.apply(extract_dom)
movies[["domain", "homepage"]].head()

                       domain                                      homepage
0         www.avatarmovie.com                   http://www.avatarmovie.com/
1               disney.go.com  http://disney.go.com/disneypictures/pirates/
2        www.sonypictures.com   http://www.sonypictures.com/movies/spectre/
3  www.thedarkknightrises.com            http://www.thedarkknightrises.com/
4           movies.disney.com          http://movies.disney.com/john-carter

## 5. Extract a set of normalized tables. That is, each entry of a normalized table must contain exactly one value (not a list or a dictionary). There is no need to use SQL for this point.

In [20]:
def concatenate_data (data,column):
    movie_id = movies.id
    d = data[column].apply(pd.DataFrame)
    for i,element in enumerate(d):
        element["movie_id"] = movie_id[i]
    d = pd.concat([element for element in d]) #two for loop
    return d

def concatenate_data1 (data,column):
    d = None
    movie_id = movies.id
    for i,element in enumerate(data[column]):
        element = pd.DataFrame(element)
        element["movie_id"] = movie_id[i]
        d = pd.concat([d,element]) #only one for loop
    return d

def normalize_by_key (data, key):
    d = data.drop_duplicates(subset = key, keep = "first")
    d = d.reset_index()
    return d

def normalize_by_movie_id(data, key):
    d = data.drop_duplicates(subset=["movie_id", key], keep = "first")
    d = d.reset_index()
    return d

#### Calculate efficiency of two version

In [21]:
import time
start = time.time()
concatenate_data(movies,"genres")
end = time.time()
print(end - start) #more efficient

11.05146336555481

In [22]:
import time
start = time.time()
concatenate_data1(movies,"genres")
end = time.time()
print(end - start)

19.515871047973633

### Normalize Movies

#### Normalize Genres

In [23]:
pd.DataFrame(movies.genres[0]) #example

    id             name
0   28           Action
1   12        Adventure
2   14          Fantasy
3  878  Science Fiction

In [24]:
concatenate_genres = concatenate_data(movies,"genres")
concatenate_genres = concatenate_genres.rename(columns={"id": "id_genre"})
genres = normalize_by_key(concatenate_genres, "id_genre")
genres[["id_genre","name"]].head()

   id_genre             name
0    28.000           Action
1    12.000        Adventure
2    14.000          Fantasy
3   878.000  Science Fiction
4    80.000            Crime

In [25]:
len(concatenate_genres.id_genre.unique()) == genres.shape[0] #check

True

In [26]:
movies_and_genres = normalize_by_movie_id(concatenate_genres, "id_genre")
movies_and_genres[["movie_id","id_genre"]].head()

   movie_id  id_genre
0     19995    28.000
1     19995    12.000
2     19995    14.000
3     19995   878.000
4       285    12.000

#### Normalize Keywords

In [27]:
pd.DataFrame(movies.keywords[0]).head() #example

     id           name
0  1463  culture clash
1  2964         future
2  3386      space war
3  3388   space colony
4  3679        society

In [28]:
concatenate_keywords = concatenate_data(movies,"keywords")
concatenate_keywords = concatenate_keywords.rename(columns={"id": "id_keywords"})
keywords = normalize_by_key(concatenate_keywords, "id_keywords")
keywords[["id_keywords","name"]].head()

   id_keywords           name
0     1463.000  culture clash
1     2964.000         future
2     3386.000      space war
3     3388.000   space colony
4     3679.000        society

In [29]:
movies_and_keywords = normalize_by_movie_id(concatenate_keywords, "id_keywords")
movies_and_keywords[["movie_id","id_keywords"]].head()

   movie_id  id_keywords
0     19995     1463.000
1     19995     2964.000
2     19995     3386.000
3     19995     3388.000
4     19995     3679.000

#### Normalize Production Companies

In [30]:
pd.DataFrame(movies.production_companies[0]) #example

    id                                    name
0  289                 Ingenious Film Partners
1  306  Twentieth Century Fox Film Corporation
2  444                      Dune Entertainment
3  574                Lightstorm Entertainment

In [31]:
concatenate_p_companies = concatenate_data(movies,"production_companies")
concatenate_p_companies = concatenate_p_companies.rename(columns={"id": "id_company"})
p_companies = normalize_by_key(concatenate_p_companies, "id_company")
p_companies[["id_company","name"]].head()

   id_company                                    name
0     289.000                 Ingenious Film Partners
1     306.000  Twentieth Century Fox Film Corporation
2     444.000                      Dune Entertainment
3     574.000                Lightstorm Entertainment
4       2.000                    Walt Disney Pictures

In [32]:
movies_and_companies = normalize_by_movie_id(concatenate_p_companies, "id_company")
movies_and_companies[["movie_id","id_company"]].head()

   movie_id  id_company
0     19995     289.000
1     19995     306.000
2     19995     444.000
3     19995     574.000
4       285       2.000

#### Normalize Production Countries

In [33]:
pd.DataFrame(movies.production_countries[0]) #example

  iso_3166_1                      name
0         US  United States of America
1         GB            United Kingdom

In [34]:
concatenate_p_countries = concatenate_data(movies,"production_countries")
concatenate_p_countries = concatenate_p_countries.rename(columns={"iso_3166_1": "id_country"})
p_countries = normalize_by_key(concatenate_p_countries, "id_country")
p_countries[["id_country","name"]].head()

  id_country                      name
0         US  United States of America
1         GB            United Kingdom
2         JM                   Jamaica
3         BS                   Bahamas
4         DM                  Dominica

In [35]:
movies_and_countries = normalize_by_movie_id(concatenate_p_countries, "id_country")
movies_and_countries[["movie_id","id_country"]].head()

   movie_id id_country
0     19995         US
1     19995         GB
2       285         US
3    206647         GB
4    206647         US

#### Normalize Spoken Languages

In [36]:
pd.DataFrame(movies.spoken_languages[0])

  iso_639_1     name
0        en  English
1        es  Español

In [37]:
concatenate_s_lang = concatenate_data(movies,"spoken_languages")
concatenate_s_lang = concatenate_s_lang.rename(columns={"iso_639_1": "id_lang"})
spoken_lang = normalize_by_key(concatenate_s_lang, "id_lang")
spoken_lang[["id_lang","name"]].head()

  id_lang      name
0      en   English
1      es   Español
2      fr  Français
3      it  Italiano
4      de   Deutsch

In [38]:
movies_and_language = normalize_by_movie_id(concatenate_s_lang, "id_lang")
movies_and_language[["movie_id","id_lang"]].head()

   movie_id id_lang
0     19995      en
1     19995      es
2       285      en
3    206647      fr
4    206647      en

### Normalize Credits

#### Normalize cast

In [39]:
concatenate_cast = concatenate_data(credits, "cast")
concatenate_cast = concatenate_cast.rename(columns={"id": "id_actor"})
cast = normalize_by_key(concatenate_cast, "credit_id")
cast[["credit_id", "cast_id", "character", "id_actor", "movie_id"]].head()

                  credit_id  cast_id            character  id_actor  movie_id
0  5602a8a7c3a3685532001c9a  242.000           Jake Sully 65731.000     19995
1  52fe48009251416c750ac9cb    3.000              Neytiri  8691.000     19995
2  52fe48009251416c750aca39   25.000  Dr. Grace Augustine 10205.000     19995
3  52fe48009251416c750ac9cf    4.000        Col. Quaritch 32747.000     19995
4  52fe48009251416c750ac9d3    5.000         Trudy Chacon 17647.000     19995

In [40]:
actor = normalize_by_key(concatenate_cast, "id_actor")
actor[["id_actor", "gender","name"]].head()

   id_actor  gender                name
0 65731.000   2.000     Sam Worthington
1  8691.000   1.000         Zoe Saldana
2 10205.000   1.000    Sigourney Weaver
3 32747.000   2.000        Stephen Lang
4 17647.000   1.000  Michelle Rodriguez

In [41]:
len(concatenate_cast.id_actor.unique()) == actor.shape[0] #check unique values

True

#### Normalize Crew

In [42]:
concatenate_crew = concatenate_data(credits, "crew")
concatenate_crew = concatenate_crew.rename(columns={"id": "id_crew"})
crew = normalize_by_key(concatenate_crew, "credit_id")
crew[["credit_id", "department", "job", "id_crew", "movie_id"]].head()

,credit_id,department,job,id_crew,movie_id
0,52fe48009251416c750aca23,Editing,Editor,1721.000,19995
1,539c47ecc3a36810e3001f87,Art,Production Design,496.000,19995
2,54491c89c3a3680fb4001cf7,Sound,Sound Designer,900.000,19995
3,54491cb70e0a267480001bd0,Sound,Supervising Sound Editor,900.000,19995
4,539c4a4cc3a36810c9002101,Production,Casting,1262.000,19995

In [43]:
crew = normalize_by_key(concatenate_crew, "id_crew")
crew[["id_crew", "gender","name"]].head()

   id_crew  gender               name
0 1721.000   0.000  Stephen E. Rivkin
1  496.000   2.000        Rick Carter
2  900.000   0.000  Christopher Boyes
3 1262.000   1.000          Mali Finn
4 1729.000   2.000       James Horner

## 6. For each movie, compute the gross margin (difference between revenue and budget)

In [44]:
movies["Gross_Margin"] = movies['revenue'] - movies['budget']
movies[["original_title", "Gross_Margin"]].head()

                             original_title  Gross_Margin
0                                    Avatar    2550965087
1  Pirates of the Caribbean: At World's End     661000000
2                                   Spectre     635674609
3                     The Dark Knight Rises     834939099
4                               John Carter      24139100

#### Which movies are in loss?

In [45]:
indice = np.where(movies['Gross_Margin'] < 0) 
movies.loc[indice].head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,runtime,spoken_languages,status,tagline,title,vote_average,vote_count,year,domain,Gross_Margin
13,255000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://disney.go.com/the-lone-ranger/,57201,"[{'id': 1556, 'name': 'texas'}, {'id': 2673, '...",en,The Lone Ranger,The Texas Rangers chase down a gang of outlaws...,49.047,"[{'name': 'Walt Disney Pictures', 'id': 2}, {'...",...,149.000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Never Take Off the Mask,The Lone Ranger,5.900,2311,2013.000,disney.go.com,-165710090
73,175000000,"[{'id': 14, 'name': 'Fantasy'}, {'id': 35, 'na...",http://www.evanalmighty.com/,2698,"[{'id': 494, 'name': 'father son relationship'...",en,Evan Almighty,God contacts Congressman Evan Baxter and tells...,27.082,"[{'name': 'Columbia Pictures', 'id': 5}, {'nam...",...,96.000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,A comedy of biblical proportions,Evan Almighty,5.300,1151,2007.000,www.evanalmighty.com,-2000000
83,27000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,79698,[],en,The Lovers,The Lovers is an epic romance time travel adve...,2.419,"[{'name': 'Corsan', 'id': 7299}, {'name': 'Bli...",...,109.000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Love is longer than life.,The Lovers,4.800,34,2015.000,NaN,-27000000
84,175000000,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,64686,"[{'id': 233, 'name': 'japan'}, {'id': 236, 'na...",en,47 Ronin,"Based on the original 1941 movie from Japan, a...",41.796,"[{'name': 'Mid Atlantic Films', 'id': 2735}, {...",...,119.000,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,For courage. For loyalty. For honor.,47 Ronin,5.900,1326,2013.000,NaN,-24037525
135,150000000,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",http://www.thewolfmanmovie.com/,7978,"[{'id': 494, 'name': 'father son relationship'...",en,The Wolfman,"Lawrence Talbot, an American man on a visit to...",21.215,"[{'name': 'Universal Pictures', 'id': 33}, {'n...",...,102.000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,When the moon is full the legend comes to life,The Wolfman,5.500,549,2010.000,www.thewolfmanmovie.com,-150000000

#### Max profit

In [46]:
movies['Gross_Margin'].max()

2550965087

#### Max loss

In [47]:
movies['Gross_Margin'].min()

-165710090

## 7. For each movie, compute the number of crew members.

In [48]:
credits["number_of_crew"] = credits.crew.apply(count_id)
credits.number_of_cast.isna().sum() #check NA

0

In [49]:
credits[["movie_id", "title", "number_of_crew"]].head()

   movie_id                                     title  number_of_crew
0     19995                                    Avatar             146
1       285  Pirates of the Caribbean: At World's End              32
2    206647                                   Spectre             150
3     49026                     The Dark Knight Rises             210
4     49529                               John Carter             129

## 8. For each movie, compute the number of directors

In [50]:
list_Reg=[]
for i in range(len(credits.crew)):
    list_Reg.append(len([i['job'] for i in credits.crew[i] if i['job'] == 'Director'])) #add only if is equal to "Director"
credits["n_director"] = list_Reg
credits[["title", "n_director"]].head()

                                      title  n_director
0                                    Avatar           1
1  Pirates of the Caribbean: At World's End           1
2                                   Spectre           1
3                     The Dark Knight Rises           1
4                               John Carter           1

In [51]:
type(credits.crew[0])

list

## 9. For each language, compute the number of movies where such language is spoken.

In [52]:
movies_and_language.groupby(["id_lang"]).size().head()

id_lang
af     7
am     1
ar    67
bg     3
bm     1
dtype: int64

## 10. For each company and each decade, compute the overall revenue

In [53]:
movies = movies.sort_values("release_date") #sort by date
movies.release_date.isna().sum()
movies[movies.release_date.isna()] #check NA

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,runtime,spoken_languages,status,tagline,title,vote_average,vote_count,year,domain,Gross_Margin
4553,0,[],NaN,380097,[],en,America Is Still the Place,1971 post civil rights San Francisco seemed li...,0.000,[],...,0.000,[],Released,NaN,America Is Still the Place,0.000,0,nan,NaN,0

In [54]:
data_format = movies["year"]
data_format = data_format.fillna(1980) #domain knowledge 
data_format = data_format.astype(int)
data_format = data_format.astype(str)

In [55]:
min(data_format), max(data_format)

('1916', '2017')

#### Decades

In [56]:
#tuples to create decades
#(sono 2 perché l'algoritmo distingue rispetto alla terza cifra per cui 2010 sarebbe considerato uguale a 1910)
tup900=[('1910-1919'),('1920-1929'),('1930-1939'),('1940-1949'),('1950-1959'),('1960-1969'),('1970-1979'),('1980-1989'),('1990-1999')]
tup2000=[('2000-2009'),('2010-2019')]

#900's
decadi=[]
for t in data_format:
    if int(t) < 2000:
        decadi.extend([n for n in tup900 if int(t[2]) == 1 + tup900.index(n)])

#2000's
for t in data_format:
    if int(t)>1999:
        decadi.extend([n for n in tup2000 if int(t[2]) == tup2000.index(n)])
        
len(decadi)

4803

In [57]:
movies["decade"] = decadi
movies = movies.sort_index()
movies.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,spoken_languages,status,tagline,title,vote_average,vote_count,year,domain,Gross_Margin,decade
0,237000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://www.avatarmovie.com/,19995,"[{'id': 1463, 'name': 'culture clash'}, {'id':...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.438,"[{'name': 'Ingenious Film Partners', 'id': 289...",...,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Enter the World of Pandora.,Avatar,7.200,11800,2009.000,www.avatarmovie.com,2550965087,2000-2009
1,300000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",http://disney.go.com/disneypictures/pirates/,285,"[{'id': 270, 'name': 'ocean'}, {'id': 726, 'na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.083,"[{'name': 'Walt Disney Pictures', 'id': 2}, {'...",...,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.900,4500,2007.000,disney.go.com,661000000,2000-2009
2,245000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{'id': 470, 'name': 'spy'}, {'id': 818, 'name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.377,"[{'name': 'Columbia Pictures', 'id': 5}, {'nam...",...,"[{'iso_639_1': 'fr', 'name': 'Français'}, {'is...",Released,A Plan No One Escapes,Spectre,6.300,4466,2015.000,www.sonypictures.com,635674609,2010-2019
3,250000000,"[{'id': 28, 'name': 'Action'}, {'id': 80, 'nam...",http://www.thedarkknightrises.com/,49026,"[{'id': 849, 'name': 'dc comics'}, {'id': 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.313,"[{'name': 'Legendary Pictures', 'id': 923}, {'...",...,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The Legend Ends,The Dark Knight Rises,7.600,9106,2012.000,www.thedarkknightrises.com,834939099,2010-2019
4,260000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://movies.disney.com/john-carter,49529,"[{'id': 818, 'name': 'based on novel'}, {'id':...",en,John Carter,"John Carter is a war-weary, former military ca...",43.927,"[{'name': 'Walt Disney Pictures', 'id': 2}]",...,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,"Lost in our world, found in another.",John Carter,6.100,2124,2012.000,movies.disney.com,24139100,2010-2019

In [58]:
movies.production_companies[0]

[{'id': 289, 'name': 'Ingenious Film Partners'},
 {'id': 306, 'name': 'Twentieth Century Fox Film Corporation'},
 {'id': 444, 'name': 'Dune Entertainment'},
 {'id': 574, 'name': 'Lightstorm Entertainment'}]

#### Each company have the same weight? of course

In [59]:
movies_and_companies.head() #reuse dataframe created with normalization

   index  id_company  movie_id                                    name
0      0     289.000     19995                 Ingenious Film Partners
1      1     306.000     19995  Twentieth Century Fox Film Corporation
2      2     444.000     19995                      Dune Entertainment
3      3     574.000     19995                Lightstorm Entertainment
4      0       2.000       285                    Walt Disney Pictures

In [60]:
num_company = pd.DataFrame(movies_and_companies.groupby("movie_id").size().reset_index())
num_company = num_company.rename(columns={0: "number_company"})
num_company.head()

   movie_id  number_company
0         5               2
1        11               2
2        12               1
3        13               1
4        14               2

In [61]:
num_company.shape

(4452, 2)

In [62]:
movies = movies.join(num_company.set_index("movie_id"), on = "id") #join number_company
movies.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,status,tagline,title,vote_average,vote_count,year,domain,Gross_Margin,decade,number_company
0,237000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://www.avatarmovie.com/,19995,"[{'id': 1463, 'name': 'culture clash'}, {'id':...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.438,"[{'name': 'Ingenious Film Partners', 'id': 289...",...,Released,Enter the World of Pandora.,Avatar,7.200,11800,2009.000,www.avatarmovie.com,2550965087,2000-2009,4.000
1,300000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",http://disney.go.com/disneypictures/pirates/,285,"[{'id': 270, 'name': 'ocean'}, {'id': 726, 'na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.083,"[{'name': 'Walt Disney Pictures', 'id': 2}, {'...",...,Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.900,4500,2007.000,disney.go.com,661000000,2000-2009,3.000
2,245000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{'id': 470, 'name': 'spy'}, {'id': 818, 'name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.377,"[{'name': 'Columbia Pictures', 'id': 5}, {'nam...",...,Released,A Plan No One Escapes,Spectre,6.300,4466,2015.000,www.sonypictures.com,635674609,2010-2019,3.000
3,250000000,"[{'id': 28, 'name': 'Action'}, {'id': 80, 'nam...",http://www.thedarkknightrises.com/,49026,"[{'id': 849, 'name': 'dc comics'}, {'id': 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.313,"[{'name': 'Legendary Pictures', 'id': 923}, {'...",...,Released,The Legend Ends,The Dark Knight Rises,7.600,9106,2012.000,www.thedarkknightrises.com,834939099,2010-2019,4.000
4,260000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://movies.disney.com/john-carter,49529,"[{'id': 818, 'name': 'based on novel'}, {'id':...",en,John Carter,"John Carter is a war-weary, former military ca...",43.927,"[{'name': 'Walt Disney Pictures', 'id': 2}]",...,Released,"Lost in our world, found in another.",John Carter,6.100,2124,2012.000,movies.disney.com,24139100,2010-2019,1.000

In [63]:
movies.number_company.isna().sum()

351

In [64]:
4803-351 #ok

4452

In [65]:
movies["revenue_company"] = movies.revenue / movies.number_company
temp = movies[["revenue_company", "id", "decade", "year"]] #temporary dataset for merge
temp.head()

   revenue_company      id     decade     year
0    696991271.750   19995  2000-2009 2009.000
1    320333333.333     285  2000-2009 2007.000
2    293558203.000  206647  2010-2019 2015.000
3    271234774.750   49026  2010-2019 2012.000
4    284139100.000   49529  2010-2019 2012.000

In [66]:
movies_and_companies = movies_and_companies.join(temp.set_index("id"), on = "movie_id") #join information
movies_and_companies.groupby(["name", "decade"]).agg({"revenue_company" : "sum"}).head()

                                           revenue_company
name                            decade
"DIA" Productions GmbH & Co. KG 2000-2009     11087731.500
1.85 Films                      2010-2019        12252.125
10 West Studios                 2010-2019            0.000
100 Bares                       2000-2009      3773982.556
                                2010-2019      2666666.667

## 11. For each decade, compute the company with maximum revenue

In [67]:
d = movies_and_companies.groupby(["decade", "name"]).agg({"revenue_company" : "max"})
movies_and_companies.groupby(["decade", "name"]).agg({"revenue_company" : "max"}).head()

                                     revenue_company
decade    name
1910-1919 Triangle Film Corporation      4197375.500
          Wark Producing Corp.           4197375.500
1920-1929 Metro-Goldwyn-Mayer (MGM)     22000000.000
          Nero Films                           0.000
          Paramount Pictures              325211.000

In [68]:
def max_dec (df):
    data = df.reset_index().sort_values(["decade", "revenue_company"], ascending = False)
    decade = list(data["decade"].unique()) #list of decades
    decade.sort #sort decades
    data = data.set_index("decade")
    max_dec = {}
    for dec in decade:
        max_dec.update({dec : data.loc[dec].sort_values("revenue_company", ascending = False).head(1)}) #first element = max
    result = None
    for values in max_dec:
        result = pd.concat([result,max_dec[values]])
    return(result.sort_index())

In [69]:
max_dec(d)

                                name  revenue_company
decade
1910-1919  Triangle Film Corporation      4197375.500
1920-1929  Metro-Goldwyn-Mayer (MGM)     22000000.000
1930-1939  Metro-Goldwyn-Mayer (MGM)    200088229.500
1940-1949    Walt Disney Productions    267447150.000
1950-1959         Paramount Pictures     36000000.000
1960-1969  Metro-Goldwyn-Mayer (MGM)    111858363.000
1970-1979                  Lucasfilm    387699003.500
1980-1989       Amblin Entertainment    396455277.000
1990-1999                  Lucasfilm    924317558.000
2000-2009    Pixar Animation Studios    940335536.000
2010-2019             Marvel Studios   1215439994.000

## 12. In each year, how many movies have revenue smaller than the budget?

In [70]:
small_rev = movies[movies.revenue < movies.budget]
small_rev.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,tagline,title,vote_average,vote_count,year,domain,Gross_Margin,decade,number_company,revenue_company
13,255000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://disney.go.com/the-lone-ranger/,57201,"[{'id': 1556, 'name': 'texas'}, {'id': 2673, '...",en,The Lone Ranger,The Texas Rangers chase down a gang of outlaws...,49.047,"[{'name': 'Walt Disney Pictures', 'id': 2}, {'...",...,Never Take Off the Mask,The Lone Ranger,5.900,2311,2013.000,disney.go.com,-165710090,2010-2019,6.000,14881651.667
73,175000000,"[{'id': 14, 'name': 'Fantasy'}, {'id': 35, 'na...",http://www.evanalmighty.com/,2698,"[{'id': 494, 'name': 'father son relationship'...",en,Evan Almighty,God contacts Congressman Evan Baxter and tells...,27.082,"[{'name': 'Columbia Pictures', 'id': 5}, {'nam...",...,A comedy of biblical proportions,Evan Almighty,5.300,1151,2007.000,www.evanalmighty.com,-2000000,2000-2009,7.000,24714285.714
83,27000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,79698,[],en,The Lovers,The Lovers is an epic romance time travel adve...,2.419,"[{'name': 'Corsan', 'id': 7299}, {'name': 'Bli...",...,Love is longer than life.,The Lovers,4.800,34,2015.000,NaN,-27000000,2010-2019,7.000,0.000
84,175000000,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,64686,"[{'id': 233, 'name': 'japan'}, {'id': 236, 'na...",en,47 Ronin,"Based on the original 1941 movie from Japan, a...",41.796,"[{'name': 'Mid Atlantic Films', 'id': 2735}, {...",...,For courage. For loyalty. For honor.,47 Ronin,5.900,1326,2013.000,NaN,-24037525,2010-2019,5.000,30192495.000
135,150000000,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",http://www.thewolfmanmovie.com/,7978,"[{'id': 494, 'name': 'father son relationship'...",en,The Wolfman,"Lawrence Talbot, an American man on a visit to...",21.215,"[{'name': 'Universal Pictures', 'id': 33}, {'n...",...,When the moon is full the legend comes to life,The Wolfman,5.500,549,2010.000,www.thewolfmanmovie.com,-150000000,2010-2019,3.000,0.000

In [71]:
small_rev.groupby("year").size().head()

year
1927.000    1
1947.000    1
1948.000    1
1954.000    1
1962.000    1
dtype: int64

## 13. Distribute the revenue according to the order of appearance in a movie. Assume that the i-th actor contributes twice as much as the (i+1)-th actor to the revenue.

In [72]:
revenue = movies[["revenue", "id"]]

In [73]:
revenue.head()

      revenue      id
0  2787965087   19995
1   961000000     285
2   880674609  206647
3  1084939099   49026
4   284139100   49529

In [74]:
credits = credits.join(revenue.set_index("id"), on = "movie_id") #join revenue
credits.head()

,movie_id,title,cast,crew,number_of_cast,number_of_crew,n_director,revenue
0,19995,Avatar,"[{'cast_id': 242, 'character': 'Jake Sully', '...","[{'credit_id': '52fe48009251416c750aca23', 'de...",83,146,1,2787965087
1,285,Pirates of the Caribbean: At World's End,"[{'cast_id': 4, 'character': 'Captain Jack Spa...","[{'credit_id': '52fe4232c3a36847f800b579', 'de...",33,32,1,961000000
2,206647,Spectre,"[{'cast_id': 1, 'character': 'James Bond', 'cr...","[{'credit_id': '54805967c3a36829b5002c41', 'de...",83,150,1,880674609
3,49026,The Dark Knight Rises,"[{'cast_id': 2, 'character': 'Bruce Wayne / Ba...","[{'credit_id': '52fe4781c3a36847f81398c3', 'de...",158,210,1,1084939099
4,49529,John Carter,"[{'cast_id': 5, 'character': 'John Carter', 'c...","[{'credit_id': '52fe479ac3a36847f813eaa3', 'de...",27,129,1,284139100

In [75]:
#function to discover actor and his position
def actor(lista_dict):
    mydict = {}
    for element in lista_dict:
        mydict.update({element["order"] : element["name"]}) #update exclude duplicates
    return (mydict)

In [76]:
#function to distribute revenue to actor (serie geometrica di ragione 1/2)
def distribution(lista_dict, revenue):
    act = actor(lista_dict)
    lis = list(act.values())
    pesi = {}
    for i, element in enumerate(lis):
        if element not in pesi.keys():
            pesi.update({element: 1/(2**i)}) # alternative = (i+1) 
        else:
            pesi[element] += 1/(2**i) #if an actor contributes more the one times
    div = sum(pesi.values())
    moltiplicatore = (revenue/div)
    for key in pesi:
        pesi[key] = round(pesi[key] * moltiplicatore, 5) #5 decimal 
    return (pesi)

#### Check empty revenue or cast

In [77]:
def empty_cast (df):
    empty = []
    for i in range(df.shape[0]):
        if not df.cast[i]:
            empty.append(i)
    return(empty)
cast_revenue = credits[["cast", "revenue"]]
cast_revenue = cast_revenue[cast_revenue.revenue != 0]
cast_revenue = cast_revenue.reset_index(0)
cast_revenue = cast_revenue.drop(empty_cast(cast_revenue))
cast_revenue = cast_revenue.reset_index(0)
cast_revenue.head()

,level_0,index,cast,revenue
0,0,0,"[{'cast_id': 242, 'character': 'Jake Sully', '...",2787965087
1,1,1,"[{'cast_id': 4, 'character': 'Captain Jack Spa...",961000000
2,2,2,"[{'cast_id': 1, 'character': 'James Bond', 'cr...",880674609
3,3,3,"[{'cast_id': 2, 'character': 'Bruce Wayne / Ba...",1084939099
4,4,4,"[{'cast_id': 5, 'character': 'John Carter', 'c...",284139100

In [78]:
def rev_actor (df):
    actor = list()
    for i in range(df.shape[0]):
        actor.append(distribution(df.cast[i], df.revenue[i]))
    actor = pd.Series(actor)
    return(actor)

In [79]:
revenue_actor = rev_actor(cast_revenue) #series with revenue

In [80]:
len(revenue_actor) #check

3374

In [81]:
cast_revenue["revenue_cast"] = revenue_actor
cast_revenue.head()

,level_0,index,cast,revenue,revenue_cast
0,0,0,"[{'cast_id': 242, 'character': 'Jake Sully', '...",2787965087,"{'Sam Worthington': 1393982543.5, 'Zoe Saldana..."
1,1,1,"[{'cast_id': 4, 'character': 'Captain Jack Spa...",961000000,"{'Johnny Depp': 480500000.02797, 'Orlando Bloo..."
2,2,2,"[{'cast_id': 1, 'character': 'James Bond', 'cr...",880674609,"{'Daniel Craig': 440337304.5, 'Christoph Waltz..."
3,3,3,"[{'cast_id': 2, 'character': 'Bruce Wayne / Ba...",1084939099,"{'Christian Bale': 542469549.5, 'Michael Caine..."
4,4,4,"[{'cast_id': 5, 'character': 'John Carter', 'c...",284139100,"{'Taylor Kitsch': 142069551.0585, 'Lynn Collin..."

#### Check

In [82]:
def check(dictionary):
    check =  int(round(sum(dictionary.values())))
    return check

In [83]:
cast_revenue["check"] = cast_revenue.revenue_cast.apply(check)
all(cast_revenue.check == cast_revenue.revenue) #ok

True

In [84]:
cast_revenue.head()

,level_0,index,cast,revenue,revenue_cast,check
0,0,0,"[{'cast_id': 242, 'character': 'Jake Sully', '...",2787965087,"{'Sam Worthington': 1393982543.5, 'Zoe Saldana...",2787965087
1,1,1,"[{'cast_id': 4, 'character': 'Captain Jack Spa...",961000000,"{'Johnny Depp': 480500000.02797, 'Orlando Bloo...",961000000
2,2,2,"[{'cast_id': 1, 'character': 'James Bond', 'cr...",880674609,"{'Daniel Craig': 440337304.5, 'Christoph Waltz...",880674609
3,3,3,"[{'cast_id': 2, 'character': 'Bruce Wayne / Ba...",1084939099,"{'Christian Bale': 542469549.5, 'Michael Caine...",1084939099
4,4,4,"[{'cast_id': 5, 'character': 'John Carter', 'c...",284139100,"{'Taylor Kitsch': 142069551.0585, 'Lynn Collin...",284139100

## 14. For each actor find the total revenue attributed to him/her.

In [85]:
def create_df (df, column):
    data = pd.Series()
    for i in range(df.shape[0]):
        series = pd.Series(df[column][i]) #transform to series
        data = data.append(series) #append each value
    d = pd.DataFrame({'name':data.index, 'revenue':data.values}) #transform to dataset
    return(d)

In [86]:
actor_revenue = create_df(cast_revenue, "revenue_cast")
actor_revenue.head()

                 name  revenue
0  Alicia Vela-Bailey    0.000
1         Allan Henry    0.000
2    Anthony Ingruber    0.000
3  April Marie Thomas    0.000
4      Ashley Jeffery    0.000

In [87]:
actor_revenue = actor_revenue.groupby("name").agg({"revenue":"sum"})

In [88]:
actor_revenue = actor_revenue.reset_index()
actor_revenue.head()

                  name      revenue
0     Larry Mullen Jr.  1515389.467
1  "Weird Al" Yankovic     2503.623
2       'Snub' Pollard      219.728
3   'Wild Bill' Laczko        4.053
4              50 Cent 43017425.606

## 15. Find the actor that is responsible for the most overall revenue.

In [89]:
actor_revenue.revenue.max()

3976119762.0574203

In [90]:
actor_revenue[actor_revenue.revenue == actor_revenue.revenue.max().max()]

             name        revenue
43382  Tom Cruise 3976119762.057